In [60]:
!pip install word2number==1.1

Collecting word2number==1.1
  Downloading word2number-1.1.zip (9.7 kB)
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py): started
  Building wheel for word2number (setup.py): finished with status 'done'
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5580 sha256=d610dde25ca7bc75cfff6a609d4ac9a1a0673f6a86ed56b1f7c135cf1d842426
  Stored in directory: c:\users\admin\appdata\local\pip\cache\wheels\a0\4a\5b\d2f2df5c344ddbecb8bea759872c207ea91d93f57fb54e816e
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1

In [61]:
import pandas as pd
import numpy as np
from sklearn import linear_model
import matplotlib.pyplot as plt
from word2number import w2n

In [62]:
data=pd.read_csv('hiring.csv')
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [63]:
data.experience = data.experience.fillna("zero")
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [64]:
data=data.rename({'test_score(out of 10)':'test_score'},axis=1)
data.test_score = data.test_score.fillna(data['test_score'].median())

In [65]:
data

  experience  test_score  interview_score(out of 10)  salary($)
0       zero         8.0                           9      50000
1       zero         8.0                           6      45000
2       five         6.0                           7      60000
3        two        10.0                          10      65000
4      seven         9.0                           6      70000
5      three         7.0                          10      62000
6        ten         8.0                           7      72000
7     eleven         7.0                           8      80000

In [66]:
data.experience = data.experience.apply(w2n.word_to_num)
data

   experience  test_score  interview_score(out of 10)  salary($)
0           0         8.0                           9      50000
1           0         8.0                           6      45000
2           5         6.0                           7      60000
3           2        10.0                          10      65000
4           7         9.0                           6      70000
5           3         7.0                          10      62000
6          10         8.0                           7      72000
7          11         7.0                           8      80000

In [67]:
reg = linear_model.LinearRegression()
reg.fit(data[['experience','test_score','interview_score(out of 10)']],data['salary($)'])

LinearRegression()

In [68]:
reg.predict([[2,9,6]])

array([53205.96797671])

In [69]:
reg.predict([[12,10,10]])

array([92002.18340611])